## 🔄 Additional Drift Detected

**Time:** 2025-11-02T03:17:14.963Z

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.app_service_account will be created
  + resource "local_file" "app_service_account" {
      + content              = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              name: cryptospins-api-sa
              namespace: default
              labels:
                app: cryptospins-api
                managed-by: terraform
              annotations:
                eks.amazonaws.com/role-arn: arn:aws:iam::269599744150:role/high-stakes-devops-eks-app-service-role
            automountServiceAccountToken: true
            
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              name: cryptospins-app-role
              labels:
                managed-by: terraform
            rules:
            - apiGroups: [""]
              resources: ["configmaps", "secrets", "services", "endpoints"]
              verbs: ["get", "list", "watch"]
            - apiGroups: ["apps"]
              resources: ["deployments", "replicasets"]
              verbs: ["get", "list", "watch"]
            
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: cryptospins-app-binding
              labels:
                managed-by: terraform
            subjects:
            - kind: ServiceAccount
              name: cryptospins-api-sa
              namespace: default
            roleRef:
              kind: ClusterRole
              name: cryptospins-app-role
              apiGroup: rbac.authorization.k8s.io
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./k8s-manifests/app-service-account.yaml"
      + id                   = (known after apply)
    }

  # local_file.cluster_info_configmap will be created
  + resource "local_file" "cluster_info_configmap" {
      + content              = <<-EOT
            apiVersion: v1
            kind: ConfigMap
            metadata:
              name: cluster-info
              namespace: default
              labels:
                app: cryptospins-infrastructure
                managed-by: terraform
                cluster: high-stakes-devops-eks
            data:
              cluster_name: "high-stakes-devops-eks"
              cluster_region: "us-east-1"
              cluster_endpoint: "https://0F111378C7089113953C39DAFFED63EF.gr7.u
... (truncated)
```